"use strict";

// //Математичні оператори

// // + - додавання
// // - - віднімання
// // * - множення
// // / - ділення
// // % - залишок від ділення
// // ** - піднесення до степеня

// // console.log(a + b);
// // console.log(a - b);
// // console.log(a * b);
// // console.log(a / b);

// // console.log(a % b);//1

// // let a = 9;
// // let b = 3;

// // a = a + 5;
// // a += 5; // a = a + 5

// // a = a + 1
// // a +=1
// // a++; //інкремент a = a + 1
// // a--; //декремент a = a - 1

// // console.log(a);

// console.log(5 ** 2); //піднесення до степеня
// //Math

// console.log(Math.ceil(1.1)); //округлення в більшу сторону
// console.log(Math.floor(1.9)); //округлення в меншу сторону
// console.log(Math.round(1.5)); //округлення до найближчого цілого
// console.log(Math.pow(2, 3)); //піднесення до степеня

// console.log(Math.max(1, 5, 10, -3)); //максимальне число
// console.log(Math.min(1, 5, 10, -3)); //мінімальне число

// console.log(Math.random()); //рандомне число від 0 до 1
// console.log(Math.random() * 10); //рандомне число від 0 до 10
// console.log(Math.floor(Math.random() * 10)); //рандомне ціле число від 0 до 9
// console.log(Math.floor(Math.random() * 10) + 1); //рандомне ціле число від 1 до 10

// let min = 5;
// let max = 11
// //генерує число від min до max включно
// const randomNum = Math.floor(Math.random() * (max - min + 1)) + min;

// // Оператори порівняння
// // > - більше
// // < - менше
// // >= - більше або дорівнює  
// // <= - менше або дорівнює
// // == - дорівнює (значення)
// // === - строго дорівнює (значення і тип даних)
// // != - не дорівнює (значення)
// // !== - строго не дорівнює (значення і тип даних)

// console.log(5 > 5); //false
// console.log(5 <= 3);
// console.log(5 >= 5);

// console.log(0 == false); // не строге порівняння

// console.log("5" === "5"); //строге порівняння